"""Напишите программу, в которой пользователь в качестве входных данных вводит числа.
Выходными данными данной программы должен стать список из 5 чисел"""
input = input("Введите числа:")
list = [input]
print(list)