"""Напишите программу, в которой пользователь вводит два числа, а затем выводится результат умножения этих чисел"""
num_1 = int(input("Введите первое число"))
num_2 = int(input("Введите второе число"))
result = num_1 * num_2
print(result)