"""Напишите программу для слияния нескольких словарей в один."""
s = {'a': '100', 'b': 120, 'c': 130, 'd': 140}
s.update({'e': 150, 'f': 160})
print(s)
