"""Напишите программу, которая принимает несколько строк в одном input()."""
str1, str2, str3 = input("Введите три имени:").split()
print("Имя 1:",str1)
print("Имя 2:",str2)
print("Имя 3:",str3)