"""Напишите программу, которая выводит строки с разделителем"""
print("Меня", "Зовут", "Тимур", sep="**")
