"""Напишите программу, которая выводит на экран все четные числа от 2 до 20."""
for number in range(2, 21):
    if number % 2 == 0:
        print(number)