""" Напишите программу, которая выводит на экран все числа от 1 до 10."""
for number in range(1, 11):
    print(number)