"""Напишите программу на Python, чтобы проверить, пустой список или нет."""
list = [] # пустой список
if not list:
    print("Список пустой")
else:
    print("Список не пустой")